function arrayManipulator(nums,commands) {
  
    for (let i = 0; i < arr.length; i++) {
        const element = array[i];
        
    }


}
arrayManipulator([1, 2, 4, 5, 6, 7],
    ['add 1 8', 'contains 1', 'contains 3', 'print']);


//- add <index> <element>  – добавя елемент към зададения индекс (елементите от 
//  тази позиция включително се изместват надясно).

//- addMany <index><element 1> <element 2> … <element n> – добавя набор от елементи по посочения индекс.

//- contains <element>  – отпечатва индекса на първото появяване на посочения елемент
//  (ако съществува) в масива или -1, ако елементът не е намерен.

//- remove <index> – премахва елемента с посочения индекс.

//- shift <positions> – измества всеки елемент от масива на брой позиции наляво (със завъртане). [1, 2, 3, 4, 5] -> shift 2 -> [3, 4, 5, 1, 2]

//- sumPairs – сумира елементите в масива по двойки (първи + втори, трети + четвърти, …).[1, 2, 4, 5, 6, 7, 8] -> [3, 9, 13, 8].

//- print - сприрате да получавате повече команди и отпечатайте последното състояние на масива в следния формат:
//  `[ {element1}, {element2}, …elementN} ]`